# IDropHandler Methods

---
The IDropHandler type exposes the following members.
| Name| Description
---|---|---
| Execute|  Implement this method to handle the drop event for your data.
Top
#### Reference
IDropHandler Interface
Autodesk.Revit.UI Namespace